Revit 2027 API
ParameterTypeId.RebarElemHookEndType Property
 "Hook At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemHookEndType { get; }
Public Shared ReadOnly Property RebarElemHookEndType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemHookEndType {
	ForgeTypeId^ get ();
}
static member RebarElemHookEndType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace